 gcc -g p1final.c -lm 
 ./a.out
Enter the first coordinate points
1
1
Enter the second coordinate points
2
2
the distance between points is 1.414214 
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main 
Breakpoint 1 at 0x93b: file p1final.c, line 19.
(gdb) r
Starting program: /home/runner/Test2Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1final.c:19
19  {
(gdb) n
21    input(&x1,&y1,&x2,&y2);
(gdb) n
Enter the first coordinate points
3
4
Enter the second coordinate points
5
6
22    find_distance(x1,y1,x2,y2,&distance);
(gdb) n
23    output(x1,y1,x2,y2,distance);
(gdb) p x1
$1 = 3
(gdb) p y1
$2 = 4
(gdb) p x2
$3 = 5
(gdb) p y2
$4 = 6
(gdb) p distance 
$5 = 2.82842708
(gdb) n
24    return 0;
(gdb) n
25  }(gdb)