gcc -g p6final.c
 ./a.out
Enter a string
helloworld
enter the substring
world
The substring helloworld of string world is 5 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main 
Breakpoint 1 at 0x8f4: file p6final.c, line 36.
(gdb) r
Starting program: /home/runner/Test2Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p6final.c:36
36  {
(gdb) n
39    input_string(a, b);
(gdb) n
Enter a string
hellwell
enter the substring
well
40    index=str_substr(a,b);
(gdb) n
41    output(a,b,index);
(gdb) p a
$1 = "hellwell\000\t\000v\306U\000\000@;", <incomplete sequence \345>
(gdb) p b
$2 = "well\000U\000\000\240\006\000v\306U\000\000\360\260\261", <incomplete sequence \303>
(gdb) p index
$3 = 0
(gdb) n
42    return 0;
(gdb) n
43  }
(gdb)
